var geoCoordMap ={'山东省': [118.180661149479, 36.3591832117009], '河北省': [114.501,38.103], '广东省': [113.41795798127, 23.304911085158], '江苏省': [119.493567255159, 32.96406782255], '湖南省': [111.714123045064, 27.6065708615055], '湖北省': [112.275362862693, 30.9741709149285], '安徽省': [117.231317604659, 31.8242328369997], '河南省': [113.620158427814, 33.8815651316235], '江西省': [115.727355016427, 27.6116595351674], '云南省': [101.488069266155, 24.9723430307123], '黑龙江省': [127.764028161919, 47.8638819473246], '四川省': [102.695076111427, 30.6265474776141], '北京市': [116.418928583527, 40.186997362785], '山西省': [112.296200326382, 37.5732626349957], '吉林省': [126.183274115673, 43.6669951527392], '浙江省': [120.143595420685, 29.1823679870677], '重庆市': [107.878733557379, 30.0542913785001], '辽宁省': [122.601827472055, 41.2784054488421], '福建省': [118.009030992873, 26.0520298085657], '甘肃省': [103.776, 36.113], '贵州省': [106.878040036454, 26.8124306415429], '陕西省': [108.874598797457, 35.1912987770767], '广西壮族自治区': [108.792353673053, 23.8185067245526], '上海市': [121.488500742226, 31.2097949653928], '内蒙古自治区': [113.912734582254, 44.0817629006645], '天津市': [117.34766061986, 39.2846747029915], '青海省': [96.0412602626546, 35.669917858908], '宁夏回族自治区': [106.167992245062, 37.2714831891357], '海南省': [109.759, 19.259], '新疆维吾尔自治区': [85.1932127338852, 41.1172994876942], '西藏自治区': [88.4435030893887, 31.4890227198578]};

var pnts=[['重庆市', 49, 50, 51], ['浙江省', 51, 42, 48], ['云南省', 23, 24, 18], ['新疆维吾尔自治区', 2, 4, 5], ['西藏自治区', 0, 0, 1], ['天津市', 29, 29, 32], ['四川省', 135, 133, 127], ['上海市', 45, 62, 82], ['陕西省', 79, 75, 66], ['山西省', 22, 21, 15], ['山东省', 117, 99, 86], ['青海省', 2, 2, 3], ['宁夏回族自治区', 6, 7, 5], ['内蒙古自治区', 11, 10, 7], ['辽宁省', 44, 44, 34], ['江西省', 36, 35, 28], ['江苏省', 90, 85, 79], ['吉林省', 14, 16, 12], ['湖南省', 97, 92, 86], ['湖北省', 107, 102, 99], ['黑龙江省', 37, 40, 27], ['河南省', 141, 135, 124], ['河北省', 99, 85, 66], ['海南省', 3, 3, 2], ['贵州省', 25, 24, 20], ['广西壮族自治区', 24, 25, 23], ['广东省', 112, 124, 153], ['甘肃省', 20, 23, 17], ['福建省', 31, 27, 25], ['北京市', 291, 330, 416], ['安徽省', 35, 29, 20]]

var lines1=[[['安徽省', '北京市'], 1], [['安徽省', '甘肃省'], 1], [['安徽省', '河南省'], 1], [['安徽省', '黑龙江省'], 2], [['安徽省', '江西省'], 1], [['安徽省', '陕西省'], 1], [['安徽省', '上海市'], 1], [['北京市', '安徽省'], 1], [['北京市', '甘肃省'], 1], [['北京市', '河南省'], 1], [['北京市', '黑龙江省'], 2], [['北京市', '山东省'], 1], [['北京市', '山西省'], 1], [['北京市', '四川省'], 3], [['北京市', '天津市'], 2], [['福建省', '湖南省'], 1], [['福建省', '上海市'], 2], [['福建省', '云南省'], 1], [['甘肃省', '湖北省'], 1], [['甘肃省', '新疆维吾尔自治区'], 1], [['广东省', '广西壮族自治区'], 2], [['广东省', '江苏省'], 1], [['广东省', '山东省'], 1], [['广东省', '天津市'], 1], [['广西壮族自治区', '广东省'], 3], [['广西壮族自治区', '贵州省'], 1], [['贵州省', '河南省'], 1], [['贵州省', '湖南省'], 1], [['贵州省', '辽宁省'], 1], [['贵州省', '云南省'], 1], [['河北省', '北京市'], 9], [['河北省', '河南省'], 1], [['河北省', '吉林省'], 1], [['河北省', '辽宁省'], 1], [['河北省', '山东省'], 2], [['河北省', '山西省'], 1], [['河北省', '陕西省'], 1], [['河北省', '天津市'], 3], [['河南省', '北京市'], 2], [['河南省', '广东省'], 2], [['河南省', '贵州省'], 2], [['河南省', '黑龙江省'], 1], [['河南省', '湖南省'], 1], [['河南省', '江苏省'], 2], [['河南省', '山东省'], 1], [['河南省', '陕西省'], 1], [['河南省', '上海市'], 1], [['河南省', '新疆维吾尔自治区'], 1], [['河南省', '重庆市'], 1], [['黑龙江省', '北京市'], 5], [['黑龙江省', '河北省'], 1], [['黑龙江省', '吉林省'], 2], [['黑龙江省', '江苏省'], 1], [['黑龙江省', '辽宁省'], 2], [['湖北省', '北京市'], 3], [['湖北省', '山东省'], 1], [['湖北省', '上海市'], 2], [['湖北省', '浙江省'], 1], [['湖南省', '北京市'], 1], [['湖南省', '广东省'], 7], [['湖南省', '广西壮族自治区'], 1], [['湖南省', '湖北省'], 1], [['湖南省', '宁夏回族自治区'], 1], [['湖南省', '浙江省'], 1], [['吉林省', '北京市'], 2], [['吉林省', '黑龙江省'], 1], [['吉林省', '湖南省'], 1], [['江苏省', '北京市'], 3], [['江苏省', '广西壮族自治区'], 1], [['江苏省', '河南省'], 1], [['江苏省', '江西省'], 1], [['江苏省', '上海市'], 8], [['江苏省', '四川省'], 3], [['江西省', '北京市'], 1], [['江西省', '河南省'], 1], [['江西省', '湖南省'], 2], [['江西省', '上海市'], 1], [['辽宁省', '北京市'], 2], [['辽宁省', '广西壮族自治区'], 1], [['辽宁省', '黑龙江省'], 3], [['辽宁省', '吉林省'], 2], [['辽宁省', '内蒙古自治区'], 1], [['辽宁省', '山东省'], 2], [['辽宁省', '陕西省'], 1], [['辽宁省', '天津市'], 1], [['内蒙古自治区', '北京市'], 1], [['内蒙古自治区', '黑龙江省'], 1], [['山东省', '北京市'], 10], [['山东省', '河北省'], 1], [['山东省', '河南省'], 1], [['山东省', '黑龙江省'], 1], [['山东省', '吉林省'], 1], [['山东省', '辽宁省'], 9], [['山东省', '陕西省'], 1], [['山东省', '上海市'], 2], [['山东省', '四川省'], 2], [['山西省', '北京市'], 1], [['山西省', '河南省'], 1], [['山西省', '黑龙江省'], 1], [['陕西省', '北京市'], 4], [['陕西省', '甘肃省'], 2], [['陕西省', '河南省'], 1], [['陕西省', '黑龙江省'], 1], [['陕西省', '江苏省'], 1], [['陕西省', '天津市'], 1], [['上海市', '安徽省'], 1], [['上海市', '北京市'], 1], [['上海市', '黑龙江省'], 1], [['上海市', '江苏省'], 2], [['上海市', '山东省'], 1], [['四川省', '甘肃省'], 1], [['四川省', '广东省'], 2], [['四川省', '江苏省'], 2], [['四川省', '山东省'], 1], [['四川省', '陕西省'], 1], [['四川省', '重庆市'], 5], [['天津市', '北京市'], 5], [['天津市', '河北省'], 3], [['云南省', '广东省'], 1], [['云南省', '重庆市'], 1], [['浙江省', '广东省'], 1], [['浙江省', '湖南省'], 1], [['浙江省', '江苏省'], 2], [['浙江省', '江西省'], 2], [['浙江省', '上海市'], 5], [['重庆市', '广东省'], 1], [['重庆市', '江苏省'], 1], [['重庆市', '上海市'], 1], [['重庆市', '四川省'], 2], [['重庆市', '云南省'], 1]]

var lines2=[[['安徽省', '北京市'], 1], [['安徽省', '上海市'], 6], [['安徽省', '四川省'], 1], [['安徽省', '天津市'], 1], [['安徽省', '浙江省'], 2], [['北京市', '广东省'], 1], [['北京市', '河北省'], 1], [['北京市', '黑龙江省'], 1], [['北京市', '湖北省'], 1], [['北京市', '湖南省'], 3], [['北京市', '吉林省'], 1], [['北京市', '江西省'], 1], [['北京市', '内蒙古自治区'], 1], [['北京市', '山东省'], 3], [['北京市', '陕西省'], 1], [['北京市', '上海市'], 1], [['北京市', '天津市'], 1], [['北京市', '重庆市'], 1], [['福建省', '北京市'], 3], [['福建省', '山东省'], 1], [['甘肃省', '安徽省'], 1], [['甘肃省', '北京市'], 1], [['甘肃省', '上海市'], 1], [['甘肃省', '天津市'], 1], [['甘肃省', '浙江省'], 2], [['广东省', '北京市'], 2], [['广东省', '广西壮族自治区'], 1], [['广东省', '河南省'], 1], [['广东省', '湖北省'], 1], [['广东省', '湖南省'], 1], [['广东省', '江苏省'], 1], [['广东省', '江西省'], 1], [['广东省', '新疆维吾尔自治区'], 1], [['广东省', '云南省'], 1], [['广东省', '重庆市'], 1], [['广西壮族自治区', '广东省'], 3], [['广西壮族自治区', '上海市'], 1], [['贵州省', '北京市'], 2], [['贵州省', '广东省'], 1], [['贵州省', '河南省'], 1], [['贵州省', '山东省'], 1], [['海南省', '陕西省'], 1], [['河北省', '北京市'], 21], [['河北省', '河南省'], 1], [['河北省', '湖北省'], 1], [['河北省', '江苏省'], 1], [['河北省', '山西省'], 1], [['河北省', '上海市'], 1], [['河北省', '四川省'], 1], [['河北省', '天津市'], 3], [['河南省', '北京市'], 13], [['河南省', '广东省'], 2], [['河南省', '黑龙江省'], 1], [['河南省', '湖北省'], 1], [['河南省', '湖南省'], 1], [['河南省', '江苏省'], 2], [['河南省', '上海市'], 2], [['黑龙江省', '北京市'], 8], [['黑龙江省', '河北省'], 3], [['黑龙江省', '河南省'], 1], [['黑龙江省', '湖北省'], 1], [['黑龙江省', '湖南省'], 1], [['黑龙江省', '吉林省'], 1], [['黑龙江省', '山西省'], 1], [['黑龙江省', '陕西省'], 1], [['黑龙江省', '上海市'], 1], [['湖北省', '北京市'], 2], [['湖北省', '广东省'], 4], [['湖北省', '江苏省'], 1], [['湖北省', '江西省'], 1], [['湖北省', '上海市'], 2], [['湖北省', '云南省'], 1], [['湖北省', '浙江省'], 1], [['湖南省', '北京市'], 1], [['湖南省', '广东省'], 8], [['湖南省', '广西壮族自治区'], 1], [['湖南省', '河北省'], 1], [['湖南省', '河南省'], 1], [['湖南省', '湖北省'], 1], [['湖南省', '江苏省'], 1], [['吉林省', '北京市'], 3], [['吉林省', '广东省'], 1], [['吉林省', '黑龙江省'], 2], [['吉林省', '四川省'], 1], [['江苏省', '安徽省'], 1], [['江苏省', '北京市'], 2], [['江苏省', '广东省'], 2], [['江苏省', '河北省'], 1], [['江苏省', '河南省'], 1], [['江苏省', '山西省'], 1], [['江苏省', '上海市'], 5], [['江苏省', '四川省'], 1], [['江苏省', '浙江省'], 3], [['江苏省', '重庆市'], 1], [['江西省', '北京市'], 1], [['江西省', '广东省'], 5], [['江西省', '江苏省'], 1], [['江西省', '山东省'], 2], [['江西省', '浙江省'], 1], [['辽宁省', '北京市'], 8], [['辽宁省', '广东省'], 2], [['辽宁省', '河北省'], 1], [['内蒙古自治区', '北京市'], 2], [['内蒙古自治区', '河北省'], 1], [['内蒙古自治区', '吉林省'], 1], [['内蒙古自治区', '浙江省'], 1], [['宁夏回族自治区', '北京市'], 1], [['宁夏回族自治区', '湖南省'], 1], [['山东省', '北京市'], 8], [['山东省', '广东省'], 1], [['山东省', '湖北省'], 1], [['山东省', '江苏省'], 2], [['山东省', '辽宁省'], 1], [['山东省', '青海省'], 1], [['山东省', '陕西省'], 1], [['山东省', '上海市'], 4], [['山东省', '四川省'], 1], [['山东省', '重庆市'], 1], [['山西省', '北京市'], 6], [['山西省', '河北省'], 1], [['山西省', '河南省'], 1], [['山西省', '天津市'], 1], [['陕西省', '北京市'], 5], [['陕西省', '广东省'], 2], [['陕西省', '河南省'], 1], [['陕西省', '内蒙古自治区'], 1], [['陕西省', '天津市'], 1], [['陕西省', '西藏自治区'], 1], [['陕西省', '新疆维吾尔自治区'], 1], [['陕西省', '重庆市'], 1], [['上海市', '北京市'], 2], [['上海市', '河南省'], 2], [['上海市', '江苏省'], 2], [['上海市', '山东省'], 1], [['上海市', '四川省'], 1], [['四川省', '北京市'], 5], [['四川省', '福建省'], 1], [['四川省', '广东省'], 4], [['四川省', '黑龙江省'], 1], [['四川省', '上海市'], 2], [['四川省', '浙江省'], 1], [['四川省', '重庆市'], 1], [['天津市', '北京市'], 2], [['天津市', '广东省'], 1], [['天津市', '河北省'], 2], [['新疆维吾尔自治区', '四川省'], 1], [['云南省', '北京市'], 2], [['云南省', '福建省'], 1], [['云南省', '广东省'], 3], [['云南省', '贵州省'], 1], [['云南省', '重庆市'], 1], [['浙江省', '湖北省'], 1], [['浙江省', '湖南省'], 1], [['浙江省', '江苏省'], 1], [['浙江省', '上海市'], 1], [['浙江省', '四川省'], 1], [['重庆市', '北京市'], 2], [['重庆市', '河南省'], 1], [['重庆市', '湖北省'], 1], [['重庆市', '上海市'], 1], [['重庆市', '四川省'], 1]]

var line_marry=[[['河南省', '安徽省'], 1], [['上海市', '安徽省'], 1], [['福建省', '北京市'], 1], [['甘肃省', '北京市'], 2], [['广东省', '北京市'], 1], [['河北省', '北京市'], 7], [['河南省', '北京市'], 6], [['黑龙江省', '北京市'], 6], [['湖北省', '北京市'], 1], [['湖南省', '北京市'], 1], [['吉林省', '北京市'], 2], [['江苏省', '北京市'], 1], [['江西省', '北京市'], 3], [['辽宁省', '北京市'], 2], [['内蒙古自治区', '北京市'], 1], [['宁夏回族自治区', '北京市'], 1], [['山东省', '北京市'], 7], [['山西省', '北京市'], 5], [['陕西省', '北京市'], 2], [['上海市', '北京市'], 1], [['四川省', '北京市'], 3], [['天津市', '北京市'], 4], [['安徽省', '福建省'], 1], [['安徽省', '广东省'], 1], [['北京市', '广东省'], 1], [['福建省', '广东省'], 2], [['广西壮族自治区', '广东省'], 2], [['海南省', '广东省'], 1], [['河南省', '广东省'], 1], [['湖北省', '广东省'], 2], [['湖南省', '广东省'], 3], [['江西省', '广东省'], 5], [['山东省', '广东省'], 1], [['陕西省', '广东省'], 2], [['四川省', '广东省'], 2], [['浙江省', '广东省'], 1], [['重庆市', '广东省'], 1], [['广东省', '广西壮族自治区'], 1], [['湖南省', '广西壮族自治区'], 1], [['湖南省', '贵州省'], 1], [['江苏省', '贵州省'], 2], [['陕西省', '贵州省'], 1], [['广东省', '海南省'], 1], [['北京市', '河北省'], 2], [['黑龙江省', '河北省'], 2], [['湖南省', '河北省'], 1], [['辽宁省', '河北省'], 1], [['天津市', '河北省'], 1], [['北京市', '河南省'], 4], [['河北省', '河南省'], 2], [['黑龙江省', '河南省'], 1], [['湖北省', '河南省'], 1], [['江苏省', '河南省'], 2], [['江西省', '河南省'], 1], [['辽宁省', '河南省'], 1], [['山西省', '河南省'], 1], [['陕西省', '河南省'], 1], [['上海市', '河南省'], 1], [['四川省', '河南省'], 1], [['天津市', '河南省'], 1], [['河南省', '黑龙江省'], 1], [['吉林省', '黑龙江省'], 1], [['江西省', '黑龙江省'], 1], [['北京市', '湖北省'], 1], [['福建省', '湖北省'], 1], [['河北省', '湖北省'], 2], [['黑龙江省', '湖北省'], 1], [['山东省', '湖北省'], 1], [['山西省', '湖北省'], 1], [['陕西省', '湖北省'], 1], [['四川省', '湖北省'], 1], [['北京市', '湖南省'], 2], [['福建省', '湖南省'], 4], [['河南省', '湖南省'], 3], [['湖北省', '湖南省'], 1], [['吉林省', '湖南省'], 1], [['江苏省', '湖南省'], 1], [['江西省', '湖南省'], 2], [['山东省', '湖南省'], 1], [['天津市', '湖南省'], 1], [['云南省', '湖南省'], 1], [['浙江省', '湖南省'], 2], [['黑龙江省', '吉林省'], 1], [['辽宁省', '吉林省'], 1], [['安徽省', '江苏省'], 1], [['河北省', '江苏省'], 2], [['黑龙江省', '江苏省'], 1], [['内蒙古自治区', '江苏省'], 1], [['陕西省', '江苏省'], 1], [['上海市', '江苏省'], 1], [['浙江省', '江苏省'], 1], [['上海市', '江西省'], 1], [['甘肃省', '辽宁省'], 1], [['黑龙江省', '辽宁省'], 3], [['吉林省', '辽宁省'], 1], [['山东省', '辽宁省'], 2], [['陕西省', '内蒙古自治区'], 1], [['江苏省', '宁夏回族自治区'], 1], [['北京市', '青海省'], 1], [['重庆市', '青海省'], 1], [['北京市', '山东省'], 3], [['内蒙古自治区', '山东省'], 1], [['山西省', '山东省'], 1], [['陕西省', '山东省'], 1], [['四川省', '山东省'], 1], [['北京市', '山西省'], 1], [['河北省', '山西省'], 1], [['江苏省', '山西省'], 1], [['北京市', '陕西省'], 1], [['河南省', '陕西省'], 2], [['山东省', '陕西省'], 1], [['山西省', '陕西省'], 1], [['天津市', '陕西省'], 1], [['安徽省', '上海市'], 4], [['甘肃省', '上海市'], 1], [['河南省', '上海市'], 1], [['江苏省', '上海市'], 4], [['辽宁省', '上海市'], 1], [['山东省', '上海市'], 1], [['四川省', '上海市'], 1], [['浙江省', '上海市'], 2], [['重庆市', '上海市'], 2], [['北京市', '四川省'], 3], [['甘肃省', '四川省'], 1], [['广东省', '四川省'], 1], [['河北省', '四川省'], 3], [['湖南省', '四川省'], 2], [['江苏省', '四川省'], 2], [['青海省', '四川省'], 1], [['山东省', '四川省'], 2], [['陕西省', '四川省'], 1], [['上海市', '四川省'], 2], [['浙江省', '四川省'], 2], [['重庆市', '四川省'], 2], [['北京市', '天津市'], 1], [['河北省', '天津市'], 2], [['黑龙江省', '天津市'], 1], [['湖南省', '天津市'], 1], [['吉林省', '天津市'], 1], [['河南省', '新疆维吾尔自治区'], 1], [['陕西省', '新疆维吾尔自治区'], 1], [['广东省', '云南省'], 2], [['四川省', '云南省'], 1], [['安徽省', '浙江省'], 2], [['北京市', '浙江省'], 1], [['江西省', '浙江省'], 1], [['安徽省', '重庆市'], 1], [['广东省', '重庆市'], 1], [['江苏省', '重庆市'], 3], [['四川省', '重庆市'], 4]]



var planePath = 'path://M1705.06,1318.313v-89.254l-319.9-221.799l0.073-208.063c0.521-84.662-26.629-121.796-63.961-121.491c-37.332-0.305-64.482,36.829-63.961,121.491l0.073,208.063l-319.9,221.799v89.254l330.343-157.288l12.238,241.308l-134.449,92.931l0.531,42.034l175.125-42.917l175.125,42.917l0.531-42.034l-134.449-92.931l12.238-241.308L1705.06,1318.313z';
var convertData = function (data) {
	var res = [];
	for (var i = 0; i < data.length; i++) {
		var dataItem = data[i];
		var fromCoord = geoCoordMap[dataItem[0][0]];
		var toCoord = geoCoordMap[dataItem[0][1]];
		if (fromCoord && toCoord) {
			res.push({
				fromName: dataItem[0][0],
				toName: dataItem[0][1],
				coords: [fromCoord, toCoord],
				value: dataItem[1]
			});
		}
	}
	return res;
};
function data2serie(Linesstr,dataItem,color){
	var fromCoord = geoCoordMap[dataItem[0][0]];
	var toCoord = geoCoordMap[dataItem[0][1]];
	var size=dataItem[1]*2;
	var data=[{
				coords:[fromCoord,toCoord],
				fromName:dataItem[0][0],
				toName:dataItem[0][1],
				value:size,
			}]
	//var size=5;
	return [{
			name:Linesstr,
			type: 'lines',
			//polyline:false,
			progressive:20000,
			progressiveThreshold:50000,
			zlevel:3,
			coordinateSystem: 'arcgis',
			data:data,
			effect: {
				show: true,
				period: 6, //箭头指向速度，值越小速度越快
				trailLength: 0.01, //特效尾迹长度[0,1]值越大，尾迹越长重
				symbol: "pin", //饼图标
				symbolSize:size*1.5
			},
			lineStyle: {
				normal: {
					//color: 'rgb(192, 157, 85)',
					color:color,
					width: 0, //尾迹线条宽度
					opacity: 0, //尾迹线条透明度
					curveness: 0.2 //尾迹线条曲直度
				}
			},
			// 设置混合模式为叠加
			blendMode: 'lighter'
		},
		{
			name: Linesstr,
			type: 'lines',
			coordinateSystem: 'arcgis',
			zlevel: 2,
			symbol: ['none', 'arrow'],
			symbolSize: size,
			lineStyle: {
				normal: {
					color: color,
					width: size,
					opacity: 0.2,
					curveness: 0.2
				}
			},
			data: data
		}
		];
};
var color = ['#a6c84c', '#ffa022', '#46bee9','#FFFF52','#FCC5DB'];
function getLineSeries(name,data,color){
	var Lseries=[];
	for(var i=0;i<data.length;i++){
		Lseries=Lseries.concat(data2serie(name,data[i],color));
	};
	return Lseries;
};
var series = [];
	series=[{
		name: '祖辈居住地',
		type:'scatter',
		coordinateSystem: 'arcgis',
		zlevel: 1,
		rippleEffect: {
			brushType: 'stroke'
		},
		label: {
			normal: {
				show: true,
				position: 'right',
				formatter: '{b}'
			}
		},
		symbolSize: function (val) {
			return val[2]/5;
		},
		itemStyle: {
			normal: {
				color: color[0]
			}
		},
		data: pnts.map(function (dataItem) {
			return {
				name: dataItem[0],
				value: geoCoordMap[dataItem[0]].concat([dataItem[1]])
			};
		})
	},{
		name: '父辈居住地',
		//type: 'effectScatter',
		type:'scatter',
		coordinateSystem: 'arcgis',
		zlevel: 1,
		rippleEffect: {
			brushType: 'stroke'
		},
		label: {
			normal: {
				show: true,
				position: 'right',
				formatter: '{b}'
			}
		},
		symbolSize: function (val) {
			return val[2] / 5;
		},
		itemStyle: {
			normal: {
				color: color[1]
			}
		},
		data: pnts.map(function (dataItem) {
			return {
				name: dataItem[0],
				value: geoCoordMap[dataItem[0]].concat([dataItem[2]])
			};
		})
	},{
		name: '受访者居住地',
		//type: 'effectScatter',
		type:'scatter',
		coordinateSystem: 'arcgis',
		zlevel: 1,
		rippleEffect: {
			brushType: 'stroke'
		},
		label: {
			normal: {
				show: true,
				position: 'right',
				formatter: '{b}'
			}
		},
		symbolSize: function (val) {
			return val[2] / 5;
		},
		itemStyle: {
			normal: {
				color: color[2]
			}
		},
		data: pnts.map(function (dataItem) {
			return {
				name: dataItem[0],
				value: geoCoordMap[dataItem[0]].concat([dataItem[3]])
			};
		})
	},
	]
series=series.concat(getLineSeries('一代迁徙',lines1,color[1]));
series=series.concat(getLineSeries('二代迁徙',lines2,color[2]));
series=series.concat(getLineSeries('跨省婚姻',line_marry,color[4]));