var data_all={'25岁及以下': {'pnts': [['山东省', 26, 22, 22], ['河北省', 25, 23, 20], ['广东省', 31, 37, 41], ['江苏省', 26, 26, 27], ['湖南省', 23, 22, 24], ['湖北省', 26, 24, 24], ['安徽省', 8, 6, 5], ['河南省', 27, 28, 26], ['江西省', 9, 7, 7], ['云南省', 10, 12, 8], ['黑龙江省', 10, 10, 10], ['四川省', 30, 25, 23], ['北京市', 48, 57, 71], ['山西省', 6, 5, 5], ['吉林省', 5, 5, 3], ['浙江省', 14, 13, 15], ['重庆市', 13, 15, 13], ['辽宁省', 8, 6, 5], ['福建省', 7, 6, 7], ['甘肃省', 6, 7, 7], ['贵州省', 9, 7, 4], ['陕西省', 17, 17, 15], ['广西壮族自治区', 13, 10, 10], ['上海市', 6, 12, 10], ['内蒙古自治区', 6, 5, 4], ['天津市', 5, 7, 8], ['青海省', 0, 0, 0], ['宁夏回族自治区', 3, 3, 3], ['海南省', 2, 2, 1], ['新疆维吾尔自治区', 1, 1, 1], ['西藏自治区', 0, 0, 1]], 'lines': {'lines1': {'辽宁省,北京市': 1, '天津市,北京市': 2, '浙江省,江苏省': 2, '内蒙古自治区,北京市': 1, '江西省,河南省': 1, '河北省,陕西省': 1, '上海市,北京市': 1, '河南省,上海市': 1, '吉林省,北京市': 1, '广西壮族自治区,广东省': 2, '贵州省,河南省': 1, '贵州省,云南省': 1, '山东省,上海市': 1, '四川省,重庆市': 2, '河北省,天津市': 1, '安徽省,陕西省': 1, '重庆市,上海市': 1, '山东省,河北省': 1, '陕西省,江苏省': 1, '江西省,北京市': 1, '湖北省,北京市': 1, '湖北省,上海市': 1, '湖南省,浙江省': 1, '河北省,北京市': 1, '北京市,天津市': 2, '江苏省,上海市': 3, '安徽省,北京市': 1, '山东省,吉林省': 1, '山西省,北京市': 1, '辽宁省,内蒙古自治区': 1, '黑龙江省,吉林省': 1, '福建省,云南省': 1, '湖南省,广东省': 2, '陕西省,天津市': 1, '广西壮族自治区,贵州省': 1, '四川省,广东省': 2, '陕西省,甘肃省': 1, '北京市,黑龙江省': 1, '四川省,陕西省': 1, '黑龙江省,北京市': 1, '内蒙古自治区,黑龙江省': 1, '河南省,重庆市': 1, '贵州省,湖南省': 1, '吉林省,湖南省': 1, '山东省,河南省': 1}, 'lines2': {'天津市,北京市': 1, '吉林省,黑龙江省': 1, '天津市,河北省': 1, '贵州省,广东省': 1, '吉林省,北京市': 1, '北京市,内蒙古自治区': 1, '云南省,贵州省': 1, '江苏省,浙江省': 2, '内蒙古自治区,北京市': 1, '上海市,山东省': 1, '河南省,江苏省': 1, '上海市,江苏省': 2, '黑龙江省,河北省': 1, '北京市,天津市': 1, '上海市,河南省': 1, '北京市,江西省': 1, '重庆市,北京市': 1, '河南省,湖北省': 1, '陕西省,天津市': 1, '重庆市,河南省': 1, '云南省,福建省': 1, '广东省,北京市': 1, '北京市,湖北省': 1, '浙江省,湖南省': 1, '北京市,吉林省': 1, '广东省,湖南省': 1}, 'lines_marry': {'北京市,陕西省': 1, '江苏省,贵州省': 1, '江苏省,湖南省': 1, '北京市,浙江省': 1, '江西省,广东省': 1, '天津市,湖南省': 1}}}, '26岁-35岁': {'pnts': [['山东省', 42, 35, 27], ['河北省', 44, 36, 27], ['广东省', 57, 61, 81], ['江苏省', 35, 30, 25], ['湖南省', 50, 48, 42], ['湖北省', 57, 54, 55], ['安徽省', 12, 10, 8], ['河南省', 85, 79, 73], ['江西省', 16, 15, 8], ['云南省', 11, 9, 8], ['黑龙江省', 16, 21, 11], ['四川省', 74, 78, 77], ['北京市', 122, 143, 193], ['山西省', 7, 8, 4], ['吉林省', 5, 5, 5], ['浙江省', 18, 18, 17], ['重庆市', 27, 26, 28], ['辽宁省', 10, 13, 7], ['福建省', 15, 12, 8], ['甘肃省', 4, 5, 2], ['贵州省', 9, 9, 8], ['陕西省', 37, 34, 29], ['广西壮族自治区', 7, 9, 7], ['上海市', 16, 18, 28], ['内蒙古自治区', 4, 4, 2], ['天津市', 16, 13, 14], ['青海省', 1, 1, 1], ['宁夏回族自治区', 3, 4, 2], ['海南省', 1, 1, 1], ['新疆维吾尔自治区', 0, 2, 3], ['西藏自治区', 0, 0, 0]], 'lines': {'lines1': {'河南省,湖南省': 1, '河北省,辽宁省': 1, '天津市,北京市': 2, '贵州省,辽宁省': 1, '湖南省,湖北省': 1, '重庆市,江苏省': 1, '河北省,山西省': 1, '广西壮族自治区,广东省': 1, '福建省,湖南省': 1, '陕西省,北京市': 3, '山东省,辽宁省': 3, '重庆市,广东省': 1, '河南省,陕西省': 1, '北京市,四川省': 1, '河南省,黑龙江省': 1, '北京市,甘肃省': 1, '河南省,广东省': 1, '河北省,北京市': 5, '山东省,北京市': 6, '湖南省,北京市': 1, '四川省,重庆市': 2, '重庆市,四川省': 2, '湖北省,北京市': 2, '天津市,河北省': 2, '河南省,新疆维吾尔自治区': 1, '河北省,天津市': 1, '湖北省,浙江省': 1, '山东省,陕西省': 1, '辽宁省,北京市': 1, '陕西省,河南省': 1, '北京市,黑龙江省': 1, '黑龙江省,北京市': 2, '四川省,江苏省': 1, '吉林省,黑龙江省': 1, '陕西省,甘肃省': 1, '江西省,湖南省': 2, '广东省,广西壮族自治区': 2, '湖北省,山东省': 1, '四川省,山东省': 1, '上海市,黑龙江省': 1, '江苏省,河南省': 1, '福建省,上海市': 2, '湖南省,宁夏回族自治区': 1, '云南省,广东省': 1, '江苏省,江西省': 1, '上海市,山东省': 1, '河南省,江苏省': 2, '安徽省,黑龙江省': 1, '北京市,山西省': 1, '安徽省,河南省': 1, '河南省,贵州省': 1, '江苏省,上海市': 2, '江苏省,四川省': 3, '江苏省,广西壮族自治区': 1, '河北省,山东省': 2, '山西省,黑龙江省': 1, '黑龙江省,吉林省': 1, '湖南省,广东省': 4, '山东省,四川省': 2, '广东省,江苏省': 1, '浙江省,湖南省': 1, '江苏省,北京市': 2, '河南省,北京市': 1, '云南省,重庆市': 1, '甘肃省,新疆维吾尔自治区': 1, '广东省,山东省': 1, '山东省,黑龙江省': 1, '辽宁省,黑龙江省': 1}, 'lines2': {'黑龙江省,河北省': 1, '辽宁省,广东省': 1, '浙江省,湖北省': 1, '北京市,湖南省': 1, '四川省,北京市': 1, '上海市,北京市': 2, '北京市,陕西省': 1, '黑龙江省,湖北省': 1, '广西壮族自治区,广东省': 1, '陕西省,北京市': 1, '山东省,上海市': 1, '江苏省,重庆市': 1, '江苏省,河南省': 1, '江西省,江苏省': 1, '山东省,广东省': 1, '北京市,河北省': 1, '甘肃省,天津市': 1, '河南省,江苏省': 1, '黑龙江省,河南省': 1, '广东省,重庆市': 1, '江苏省,浙江省': 1, '山东省,北京市': 1, '宁夏回族自治区,湖南省': 1, '江苏省,上海市': 1, '山西省,北京市': 1, '北京市,山东省': 1, '新疆维吾尔自治区,四川省': 1, '湖南省,广东省': 2, '广西壮族自治区,上海市': 1, '黑龙江省,山西省': 1, '广东省,新疆维吾尔自治区': 1, '广东省,广西壮族自治区': 1, '陕西省,河南省': 1, '广东省,云南省': 1, '黑龙江省,北京市': 1, '甘肃省,上海市': 1, '吉林省,四川省': 1, '辽宁省,北京市': 1, '山东省,湖北省': 1, '重庆市,北京市': 1}, 'lines_marry': {'山西省,陕西省': 1, '河北省,北京市': 2, '福建省,广东省': 1, '湖南省,北京市': 1, '黑龙江省,河南省': 1, '四川省,广东省': 2, '江苏省,宁夏回族自治区': 1, '重庆市,上海市': 1, '四川省,湖北省': 1, '河南省,黑龙江省': 1, '江西省,北京市': 3, '山东省,湖南省': 1, '甘肃省,四川省': 1, '四川省,重庆市': 4, '云南省,湖南省': 1, '湖北省,湖南省': 1, '广东省,重庆市': 1, '辽宁省,北京市': 1, '辽宁省,河南省': 1, '上海市,四川省': 2, '黑龙江省,北京市': 3, '北京市,河南省': 4, '山东省,湖北省': 1, '湖南省,河北省': 1, '河北省,山西省': 1, '吉林省,黑龙江省': 1, '黑龙江省,河北省': 1, '陕西省,内蒙古自治区': 1, '重庆市,广东省': 1, '江西省,湖南省': 1, '广东省,广西壮族自治区': 1, '黑龙江省,天津市': 1, '江西省,河南省': 1, '江苏省,河南省': 2, '四川省,云南省': 1, '四川省,北京市': 1, '山西省,山东省': 1, '河北省,四川省': 2, '吉林省,湖南省': 1, '湖北省,北京市': 1, '四川省,上海市': 1, '宁夏回族自治区,北京市': 1, '陕西省,新疆维吾尔自治区': 1, '内蒙古自治区,山东省': 1, '山西省,北京市': 3, '内蒙古自治区,北京市': 1, '甘肃省,上海市': 1, '河南省,陕西省': 1, '江苏省,重庆市': 3, '山东省,上海市': 1, '湖南省,四川省': 2, '天津市,北京市': 3, '广东省,四川省': 1, '陕西省,广东省': 2, '陕西省,贵州省': 1, '浙江省,四川省': 1, '福建省,湖南省': 4, '安徽省,江苏省': 1, '广东省,云南省': 2, '河南省,湖南省': 3, '湖北省,广东省': 1, '天津市,陕西省': 1, '北京市,四川省': 2, '陕西省,江苏省': 1, '青海省,四川省': 1, '浙江省,广东省': 1, '河南省,北京市': 2, '江苏省,四川省': 2, '上海市,北京市': 1, '福建省,湖北省': 1, '河南省,安徽省': 1, '重庆市,四川省': 2, '上海市,河南省': 1, '河南省,新疆维吾尔自治区': 1, '河北省,天津市': 2, '北京市,山东省': 1, '广东省,海南省': 1, '北京市,湖北省': 1, '辽宁省,河北省': 1, '安徽省,广东省': 1, '江西省,广东省': 3, '北京市,湖南省': 2, '甘肃省,北京市': 1, '辽宁省,吉林省': 1, '吉林省,北京市': 1, '四川省,山东省': 1, '黑龙江省,湖北省': 1, '山东省,广东省': 1, '吉林省,天津市': 1, '北京市,山西省': 1, '江苏省,贵州省': 1, '北京市,天津市': 1, '海南省,广东省': 1, '山东省,北京市': 3, '山西省,湖北省': 1, '湖南省,广东省': 3, '山东省,四川省': 2, '上海市,安徽省': 1, '浙江省,湖南省': 2, '江苏省,北京市': 1, '天津市,河南省': 1, '黑龙江省,吉林省': 1, '河北省,河南省': 2, '河北省,湖北省': 2}}}, '36岁-45岁': {'pnts': [['山东省', 30, 26, 21], ['河北省', 17, 15, 10], ['广东省', 18, 21, 25], ['江苏省', 11, 13, 12], ['湖南省', 12, 11, 10], ['湖北省', 15, 14, 11], ['安徽省', 9, 10, 4], ['河南省', 20, 21, 19], ['江西省', 8, 10, 10], ['云南省', 2, 3, 2], ['黑龙江省', 9, 6, 3], ['四川省', 22, 23, 20], ['北京市', 76, 79, 98], ['山西省', 7, 6, 3], ['吉林省', 1, 3, 2], ['浙江省', 9, 5, 8], ['重庆市', 6, 6, 7], ['辽宁省', 16, 16, 14], ['福建省', 9, 9, 10], ['甘肃省', 5, 5, 4], ['贵州省', 6, 6, 6], ['陕西省', 14, 13, 12], ['广西壮族自治区', 4, 4, 3], ['上海市', 12, 13, 22], ['内蒙古自治区', 0, 0, 0], ['天津市', 7, 7, 9], ['青海省', 0, 0, 0], ['宁夏回族自治区', 0, 0, 0], ['海南省', 0, 0, 0], ['新疆维吾尔自治区', 0, 0, 0], ['西藏自治区', 0, 0, 0]], 'lines': {'lines1': {'黑龙江省,辽宁省': 2, '天津市,河北省': 1, '安徽省,江西省': 1, '辽宁省,吉林省': 2, '陕西省,北京市': 1, '北京市,河南省': 1, '山东省,辽宁省': 3, '河北省,天津市': 1, '北京市,四川省': 2, '河南省,山东省': 1, '湖北省,上海市': 1, '河南省,广东省': 1, '上海市,江苏省': 1, '山东省,北京市': 3, '山西省,河南省': 1, '浙江省,广东省': 1, '四川省,重庆市': 1, '辽宁省,陕西省': 1, '浙江省,江西省': 1, '黑龙江省,河北省': 1, '黑龙江省,江苏省': 1, '湖南省,广东省': 1, '陕西省,黑龙江省': 1, '上海市,安徽省': 1, '河北省,北京市': 2, '北京市,安徽省': 1, '重庆市,云南省': 1, '黑龙江省,北京市': 1, '河北省,河南省': 1, '辽宁省,山东省': 1, '浙江省,上海市': 2, '辽宁省,黑龙江省': 1}, 'lines2': {'黑龙江省,河北省': 1, '辽宁省,广东省': 1, '吉林省,北京市': 1, '江苏省,上海市': 1, '四川省,黑龙江省': 1, '安徽省,上海市': 1, '四川省,北京市': 1, '黑龙江省,陕西省': 1, '广东省,江苏省': 1, '山东省,辽宁省': 1, '河北省,天津市': 1, '北京市,山东省': 1, '天津市,北京市': 1, '云南省,重庆市': 1, '辽宁省,北京市': 1, '安徽省,天津市': 1, '广东省,江西省': 1}, 'lines_marry': {'黑龙江省,河北省': 1, '湖北省,河南省': 1, '江西省,浙江省': 1, '黑龙江省,辽宁省': 2, '江西省,广东省': 1, '四川省,河南省': 1, '福建省,广东省': 1, '安徽省,浙江省': 1, '浙江省,四川省': 1, '天津市,北京市': 1, '广西壮族自治区,广东省': 2, '陕西省,湖北省': 1, '陕西省,北京市': 2, '辽宁省,上海市': 1, '山东省,辽宁省': 1, '甘肃省,辽宁省': 1, '重庆市,上海市': 1, '四川省,北京市': 2, '北京市,河北省': 1, '北京市,四川省': 1, '黑龙江省,北京市': 3, '河北省,江苏省': 1, '河南省,北京市': 2, '河北省,北京市': 3, '山东省,北京市': 3, '天津市,河北省': 1, '江苏省,上海市': 2, '安徽省,福建省': 1, '山西省,河南省': 1, '山西省,北京市': 2, '黑龙江省,江苏省': 1, '安徽省,上海市': 3, '北京市,广东省': 1, '山东省,陕西省': 1, '陕西省,河南省': 1, '北京市,山东省': 1, '安徽省,重庆市': 1, '广东省,北京市': 1, '内蒙古自治区,江苏省': 1, '河南省,广东省': 1, '江西省,黑龙江省': 1, '浙江省,上海市': 1, '陕西省,四川省': 1}}}, '46岁-55岁': {'pnts': [['山东省', 12, 11, 12], ['河北省', 8, 7, 6], ['广东省', 6, 5, 6], ['江苏省', 10, 9, 10], ['湖南省', 9, 9, 8], ['湖北省', 7, 8, 7], ['安徽省', 4, 1, 1], ['河南省', 9, 7, 6], ['江西省', 2, 1, 1], ['云南省', 0, 0, 0], ['黑龙江省', 2, 2, 2], ['四川省', 9, 7, 6], ['北京市', 32, 37, 38], ['山西省', 1, 1, 1], ['吉林省', 1, 1, 0], ['浙江省', 7, 6, 8], ['重庆市', 2, 2, 2], ['辽宁省', 6, 6, 6], ['福建省', 0, 0, 0], ['甘肃省', 5, 6, 4], ['贵州省', 0, 1, 1], ['陕西省', 9, 9, 9], ['广西壮族自治区', 0, 0, 1], ['上海市', 5, 9, 11], ['内蒙古自治区', 1, 1, 1], ['天津市', 1, 2, 1], ['青海省', 1, 1, 1], ['宁夏回族自治区', 0, 0, 0], ['海南省', 0, 0, 0], ['新疆维吾尔自治区', 1, 1, 1], ['西藏自治区', 0, 0, 0]], 'lines': {'lines1': {'四川省,甘肃省': 1, '河南省,贵州省': 1, '广东省,天津市': 1, '江苏省,上海市': 1, '安徽省,黑龙江省': 1, '河北省,吉林省': 1, '安徽省,上海市': 1, '江西省,上海市': 1, '吉林省,北京市': 1, '辽宁省,天津市': 1, '安徽省,甘肃省': 1, '山东省,辽宁省': 2, '江苏省,北京市': 1, '四川省,江苏省': 1, '黑龙江省,北京市': 1, '辽宁省,山东省': 1, '甘肃省,湖北省': 1, '浙江省,上海市': 1, '天津市,北京市': 1, '河南省,北京市': 1}, 'lines2': {'湖北省,江苏省': 1, '北京市,山东省': 1, '吉林省,北京市': 1, '天津市,广东省': 1, '甘肃省,浙江省': 1}, 'lines_marry': {'湖南省,天津市': 1, '上海市,江苏省': 1, '山东省,北京市': 1, '浙江省,江苏省': 1, '吉林省,北京市': 1, '江苏省,上海市': 1, '河北省,江苏省': 1, '安徽省,浙江省': 1, '河南省,陕西省': 1, '江西省,湖南省': 1, '河南省,上海市': 1, '安徽省,上海市': 1, '陕西省,山东省': 1, '上海市,江西省': 1, '山东省,辽宁省': 1, '河北省,北京市': 2, '黑龙江省,辽宁省': 1, '湖北省,广东省': 1, '北京市,河北省': 1, '福建省,北京市': 1, '北京市,山东省': 1, '湖南省,贵州省': 1, '北京市,青海省': 1, '吉林省,辽宁省': 1, '河南省,北京市': 2}}}, '56岁-65岁': {'pnts': [['山东省', 6, 5, 4], ['河北省', 4, 4, 3], ['广东省', 0, 0, 0], ['江苏省', 5, 5, 4], ['湖南省', 2, 1, 1], ['湖北省', 2, 2, 2], ['安徽省', 1, 1, 1], ['河南省', 0, 0, 0], ['江西省', 1, 1, 1], ['云南省', 0, 0, 0], ['黑龙江省', 0, 1, 1], ['四川省', 0, 0, 1], ['北京市', 8, 8, 10], ['山西省', 1, 1, 1], ['吉林省', 2, 2, 2], ['浙江省', 2, 0, 0], ['重庆市', 1, 1, 1], ['辽宁省', 4, 3, 2], ['福建省', 0, 0, 0], ['甘肃省', 0, 0, 0], ['贵州省', 1, 1, 1], ['陕西省', 2, 2, 1], ['广西壮族自治区', 0, 2, 2], ['上海市', 6, 8, 9], ['内蒙古自治区', 0, 0, 0], ['天津市', 0, 0, 0], ['青海省', 0, 0, 1], ['宁夏回族自治区', 0, 0, 0], ['海南省', 0, 0, 0], ['新疆维吾尔自治区', 0, 0, 0], ['西藏自治区', 0, 0, 0]], 'lines': {'lines1': {'上海市,江苏省': 1, '山东省,辽宁省': 1, '北京市,山东省': 1, '江苏省,上海市': 1, '山东省,北京市': 1, '辽宁省,广西壮族自治区': 1, '湖南省,广西壮族自治区': 1, '浙江省,上海市': 2, '辽宁省,黑龙江省': 1}, 'lines2': {'山东省,青海省': 1, '江苏省,上海市': 1}, 'lines_marry': {'重庆市,青海省': 1, '甘肃省,北京市': 1, '湖南省,广西壮族自治区': 1, '辽宁省,北京市': 1, '浙江省,上海市': 1, '河北省,四川省': 1}}}, '66岁及以上': {'pnts': [['山东省', 1, 0, 0], ['河北省', 1, 0, 0], ['广东省', 0, 0, 0], ['江苏省', 3, 2, 1], ['湖南省', 1, 1, 1], ['湖北省', 0, 0, 0], ['安徽省', 1, 1, 1], ['河南省', 0, 0, 0], ['江西省', 0, 1, 1], ['云南省', 0, 0, 0], ['黑龙江省', 0, 0, 0], ['四川省', 0, 0, 0], ['北京市', 5, 6, 6], ['山西省', 0, 0, 1], ['吉林省', 0, 0, 0], ['浙江省', 1, 0, 0], ['重庆市', 0, 0, 0], ['辽宁省', 0, 0, 0], ['福建省', 0, 0, 0], ['甘肃省', 0, 0, 0], ['贵州省', 0, 0, 0], ['陕西省', 0, 0, 0], ['广西壮族自治区', 0, 0, 0], ['上海市', 0, 2, 2], ['内蒙古自治区', 0, 0, 0], ['天津市', 0, 0, 0], ['青海省', 0, 0, 0], ['宁夏回族自治区', 0, 0, 0], ['海南省', 0, 0, 0], ['新疆维吾尔自治区', 0, 0, 0], ['西藏自治区', 0, 0, 0]], 'lines': {'lines1': {'山东省,上海市': 1, '浙江省,江西省': 1, '河北省,北京市': 1, '江苏省,上海市': 1}, 'lines2': {}, 'lines_marry': {'江苏省,上海市': 1, '江苏省,山西省': 1}}}}

var geoCoordMap ={'山东省': [118.180661149479, 36.3591832117009], '河北省': [114.501,38.103], '广东省': [113.41795798127, 23.304911085158], '江苏省': [119.493567255159, 32.96406782255], '湖南省': [111.714123045064, 27.6065708615055], '湖北省': [112.275362862693, 30.9741709149285], '安徽省': [117.231317604659, 31.8242328369997], '河南省': [113.620158427814, 33.8815651316235], '江西省': [115.727355016427, 27.6116595351674], '云南省': [101.488069266155, 24.9723430307123], '黑龙江省': [127.764028161919, 47.8638819473246], '四川省': [102.695076111427, 30.6265474776141], '北京市': [116.418928583527, 40.186997362785], '山西省': [112.296200326382, 37.5732626349957], '吉林省': [126.183274115673, 43.6669951527392], '浙江省': [120.143595420685, 29.1823679870677], '重庆市': [107.878733557379, 30.0542913785001], '辽宁省': [122.601827472055, 41.2784054488421], '福建省': [118.009030992873, 26.0520298085657], '甘肃省': [103.776, 36.113], '贵州省': [106.878040036454, 26.8124306415429], '陕西省': [108.874598797457, 35.1912987770767], '广西壮族自治区': [108.792353673053, 23.8185067245526], '上海市': [121.488500742226, 31.2097949653928], '内蒙古自治区': [113.912734582254, 44.0817629006645], '天津市': [117.34766061986, 39.2846747029915], '青海省': [96.0412602626546, 35.669917858908], '宁夏回族自治区': [106.167992245062, 37.2714831891357], '海南省': [109.759, 19.259], '新疆维吾尔自治区': [85.1932127338852, 41.1172994876942], '西藏自治区': [88.4435030893887, 31.4890227198578]};

var ages=['25岁及以下', '26岁-35岁', '36岁-45岁', '46岁-55岁', '56岁-65岁', '66岁及以上']


function data2serie(Linesstr,dataItem,color){
	var fromCoord = geoCoordMap[dataItem[0][0]];
	var toCoord = geoCoordMap[dataItem[0][1]];
	var size=dataItem[1]*2;
	var data=[{
				coords:[fromCoord,toCoord],
				fromName:dataItem[0][0],
				toName:dataItem[0][1],
				value:size,
			}]
	//var size=5;
	return [{
			name:Linesstr,
			type: 'lines',
			//polyline:false,
			progressive:20000,
			progressiveThreshold:50000,
			zlevel:3,
			coordinateSystem: 'arcgis',
			data:data,
			effect: {
				show: true,
				period: 6, //箭头指向速度，值越小速度越快
				trailLength: 0.01, //特效尾迹长度[0,1]值越大，尾迹越长重
				symbol: "pin", //饼图标
				symbolSize:size*1.5
			},
			lineStyle: {
				normal: {
					//color: 'rgb(192, 157, 85)',
					color:color,
					width: 0, //尾迹线条宽度
					opacity: 0, //尾迹线条透明度
					curveness: 0.2 //尾迹线条曲直度
				}
			},
			// 设置混合模式为叠加
			blendMode: 'lighter'
		},
		{
			name: Linesstr,
			type: 'lines',
			coordinateSystem: 'arcgis',
			zlevel: 2,
			symbol: ['none', 'arrow'],
			symbolSize: size,
			lineStyle: {
				normal: {
					color: color,
					width: size,
					opacity: 0.2,
					curveness: 0.2
				}
			},
			data: data
		}
		];
};

function getLineSeries(name,data,color){
	var Lseries=[];
	if (data===undefined || data=={} || data==null){
		return [{type:'lines',data:[]}]
	}else{
		keys=Object.keys(data)
		for(var i=0;i<keys.length ;i++){
			da=data[keys[i]]
			da2=[keys[i].split(','),da]
			Lseries=Lseries.concat(data2serie(name,da2,color));
		};
		return Lseries;		
	}
};

var color = ['#a6c84c', '#ffa022', '#46bee9','#FFFF52','#FCC5DB'];

function getScatter(name,pnts,valueidx){
		return {
		name: name,
		type:'scatter',
		coordinateSystem: 'arcgis',
		zlevel: 1,
		rippleEffect: {
			brushType: 'stroke'
		},
		label: {
			normal: {
				show: true,
				position: 'right',
				formatter: '{b}'
			}
		},
		symbolSize: function (val) {
			return val[2]/5;
		},
		itemStyle: {
			normal: {
				color: color[0]
			}
		},
		data: pnts.map(function (dataItem) {
			return {
				name: dataItem[0],
				value: geoCoordMap[dataItem[0]].concat([dataItem[valueidx]])
			};
		})
	}
}
var options_all=[];
for(var i=0;i<ages.length;i++){
	var series= [];
	series=[getScatter('祖辈居住地',data_all[ages[i]]['pnts'],1),getScatter('父辈居住地',data_all[ages[i]]['pnts'],2),getScatter('受访者居住地',data_all[ages[i]]['pnts'],3),getLineSeries('一代迁徙',data_all[ages[i]]['lines']['lines1'],color[1]),getLineSeries('二代迁徙',data_all[ages[i]]['lines']['lines2'],color[2]),getLineSeries('跨省婚姻',data_all[ages[i]]['lines']['lines_marry'],color[4])];
	//series=[getScatter('祖辈居住地',data_all[ages[i]]['pnts'],1)];	
	options_all.push({series:series})
}